app/Controllers/Home.php

    public function borrarinfromacion($id)
    {
        $db = \Config\Database::connect();
        $db->table('informacion')->where('id', $id)->delete();   // borrar la noticia segun el ID proporcionado
---
DELETE FROM "informacion"
WHERE "id" = '1'

    public function agregarInformacion()
{
    $data = $this->request->getJSON(true); // insertar los datos enviados en la solicitud POST en formato JSON

    // comando para agregar o insertar los datos a la base de datos
    $db = \Config\Database::connect();
    $db->table('informacion')->set($data)->insert();
---
INSERT INTO "informacion" ("id", "tema", "argumento", "fecha", "fuente", "url") VALUES ('1', 'Título de la nueva noticia', 'Contenido de la nueva noticia', '2023-07-11', 'Croni', 'https://cronica.com.ec/2023/07/06/mas-de-40-descargas-de-agua-contaminada-llegan-a-los-rios-malacatos-y-zamora/')

public function actualizarInformacion($id)
{
    $data = $this->request->getJSON(true); // Insertar los datos enviados en la solicitud POST en formato JSON

    // Comando para actualizar los datos en la base de datos
    $db = \Config\Database::connect();
    $db->table('informacion')->set($data)->where('id', $id)->update();
---
UPDATE "informacion" SET "id" = '5', "tema" = '03 DE NOVIEMBRE:El DÍA INTERNACIONAL CONTRA LA VIOLENCIA Y EL ACOSO ESCOLAR DE NIÑAS, NIÑOS Y ADOLESCENTES', "argumento" = 'La violencia contra las niñas, niños y adolescentes asume formas y magnitudes cada vez más diversas e intensas. Entre estas nuevas formas se encuentran el acoso escolar y el ciberacoso, que afecta a millones de niños a nivel mundial, y que dejan profundas secuelas psicológicas que pueden perdurar para toda la vida....', "fecha" = '2022-11-07', "fuente" = 'Protección derechos', "url" = 'https://proteccionderechosquito.gob.ec/2022/11/07/15041173/'
WHERE "id" = '8'